'''
Задание №1
Есть последовательность
my_list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
Напишите рекурсивную функцию, которая выведет все элементы от первого
до последнего и в конце отобразит сообщение Конец списка, если выводить
больше нечего. Циклы использовать запрещено
Вместе с файлом, отправляемом на проверку домашнего задания,
комментарием укажите ссылку на репозиторий GitHub, где хранится ваша
программа.
'''


def print_list(nums):
    if len(nums) < 1:
        print('Конец списка')
        return
    print(nums.pop(0))
    print_list(nums)


my_list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
print_list(my_list)
